Show / Hide Table of Contents
Class ResultOnMembers2
Result of member
Inheritance
System.Object
ResultOnMembers2
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obsolete]
public class ResultOnMembers2
Constructors
Improve this Doc   View Source
ResultOnMembers2()
Constructor
Declaration
public ResultOnMembers2()
Improve this Doc   View Source
ResultOnMembers2(ResultType)
Constructor
 Type of result
Declaration
public ResultOnMembers2(ResultType resultType)
Parameters
 Type |  Name |  Description
 ResultType |  resultType
Properties
Improve this Doc   View Source
Results
List of results of members
Declaration
public List<ResultOfMember2> Results { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ResultOfMember2>
Improve this Doc   View Source
ResultType
Type of result
Declaration
public ResultType ResultType { get; set; }
Property Value
 Type |  Description
 ResultType
 Improve this Doc
 View Source